Revit 2027 API
RebarConstrainedHandle.GetHandlePosition Method
 Gets the position of this handle as it is while editing constraints.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetHandlePosition(
	View view
)
Public Function GetHandlePosition (
	view As View
) As XYZ
public:
XYZ^ GetHandlePosition(
	View^ view
)
member GetHandlePosition :
        view : View -> XYZ
Parameters
view View
 The view in which the position is requested.
Return Value
XYZ
 Returns the position of this handle as it is while editing constraints.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  RebarConstrainedHandle is no longer valid.
See Also
Reference
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace